### Uriage.csv

1. 파일 로드
2. purchase_date 컬럼을 시계열 데이터 변경
3. item_name 컬럼의 값들을 다 대문자로 변경
4. item_name 컬럼의 값들 공백 전부 삭제
5. item_name을 기준으로 오름차순 정렬
6. 인덱스 재지정
7. 결측치의 값 확인

In [1]:
import pandas as pd

In [72]:
#데이터 로드하기
uriage_data = pd.read_csv("../practice1/data/uriage.csv")
print(uriage_data)

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
1     2019-07-13 13:05     상 품 S         NaN           김우찬
2     2019-05-11 19:42     상 품 a         NaN           김유찬
3     2019-02-12 23:40       상품Z      2600.0           김재현
4      2019-04-22 3:09       상품a         NaN           김강현
...                ...       ...         ...           ...
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2996  2019-03-29 11:14       상품Q         NaN           김지율
2997  2019-07-14 12:56       상품H         NaN           김승주
2998   2019-07-21 0:31       상품D       400.0           정준기

[2999 rows x 4 columns]

In [87]:
uriage = uriage_data.copy()

In [88]:
#시계열데이터로 변경하기
#기본 시계열데이터 포맷과 같기 때문에 format 생략 가능
uriage["purchase_date"] = pd.to_datetime(uriage["purchase_date"], format="%Y-%m-%d %H:%M") 
uriage

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-07-13 13:05:00     상 품 S         NaN           김우찬
2    2019-05-11 19:42:00     상 품 a         NaN           김유찬
3    2019-02-12 23:40:00       상품Z      2600.0           김재현
4    2019-04-22 03:09:00       상품a         NaN           김강현
...                  ...       ...         ...           ...
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기

[2999 rows x 4 columns]

In [89]:
#대문자 변경
#일반적인 문자열이 아니기 때문에  str 문자열화 시킨 뒤 Upper 적용
uriage["item_name"] = uriage["item_name"].str.upper()
uriage

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-07-13 13:05:00     상 품 S         NaN           김우찬
2    2019-05-11 19:42:00     상 품 A         NaN           김유찬
3    2019-02-12 23:40:00       상품Z      2600.0           김재현
4    2019-04-22 03:09:00       상품A         NaN           김강현
...                  ...       ...         ...           ...
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기

[2999 rows x 4 columns]

In [90]:
#공백삭제

#case1
#uriage["item_name"] = uriage["item_name"].apply(lambda x : x.replace(" ", ""))

#case2
def change(x):
    return x.replace(" ","")

uriage["item_name"] = uriage["item_name"].apply(change)

#case3
#uriage["item_name"].str.replace(" ","")

In [91]:
# 정렬
uriage.sort_values(["item_name"], inplace= True)

In [92]:
# 인덱스 재지정
uriage.reset_index(drop = True, inplace= True)

In [93]:
uriage

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-05-19 20:22:00       상품A       100.0           김시훈
2    2019-06-25 08:13:00       상품A       100.0           김유진
3    2019-06-13 16:03:00       상품A       100.0           김건희
4    2019-02-10 00:28:00       상품A       100.0           김하랑
...                  ...       ...         ...           ...
2994 2019-04-22 00:36:00       상품Y         NaN           김동욱
2995 2019-04-30 14:21:00       상품Y         NaN           김하준
2996 2019-01-24 10:27:00       상품Y      2500.0           김범준
2997 2019-05-28 13:45:00       상품Y      2500.0           김수현
2998 2019-02-12 23:40:00       상품Z      2600.0           김재현

[2999 rows x 4 columns]

In [94]:
#결측치 확인
uriage.isna().sum()

purchase_date      0
item_name          0
item_price       387
customer_name      0
dtype: int64

In [71]:
#결측치의 값에 해당하는 item_name들의 item_price 값으로 치환하기
fig_null = uriage["item_price"].isna() #null값 불린 형태 리스트를 fig null 저장

#결측치인 데이터프레임에서 "item_name"인 열만 출력
#unique() 는 중복을 없애주는 함수 -> 왜 리스트로 바뀌지?
name_list = uriage.loc[fig_null, "item_name"].unique()

## "~연산자" -> 부정
## ~Flase = True / ~True= False
# null이 False이고 & "item_name"컬럼이고 & "상품A" 이면 그 값의 가격들을 뽑아오자
# 그 중 max() 값을 chage_price로 받는다.
uriage.loc[~fig_null & (uriage["item_name"] == "상품A"), "item_price"].max()

for i in list(name_list):
    price = uriage.loc[~fig_null & (uriage["item_name"] == i ), "item_price"].max() #i와 같으면 price에 값 저장
    uriage["item_price"].loc[(fig_null) & (uriage["item_name"] == i)] = price  #조건을 만족하면 저장한 price 값을 대입

C:\Users\chk\AppData\Local\Temp\ipykernel_31844\3303898071.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  uriage["item_price"].loc[(fig_null)&(uriage["item_name"] == i)] = price

In [96]:
for i in list(name_list):
    print(i)

상품A
상품B
상품C
상품D
상품E
상품F
상품G
상품H
상품I
상품J
상품K
상품L
상품M
상품N
상품O
상품P
상품Q
상품R
상품S
상품T
상품U
상품V
상품W
상품X
상품Y